OdDAIObjectId.erase
\details
Erases the object associated with the identifier.
\remarks Objects can be erased by calling Model::deleteInstance() method only.

OdDAIObjectId.getHandle
\details
Retrieves the database handle of the object referenced by the identifier.
\returns Returns the object's database handle.
\remarks
Returns a NULL handle if no database object is referenced by the identifier. The handle equals the file's step-id if
the owning model of the entity was loaded from a file.

OdDAIObjectId.isErased
\details
Determines whether the object associated with the identifier was erased.
\returns Returns true if the object associated with the identifier was erased; otherwise, the method returns false.

OdDAIObjectId.model
\details
Retrieves the model identifier object is associated with.
\returns Returns a raw pointer to the database object.
\remarks
Returns a NULL pointer if the identifier object is not associated with any database.

OdDAIObjectId.op_MemberSelection
\details
The operator for the access through a pointer to an identifier.
\returns A raw pointer to an OdDbStub object that represents the identifier.
\remarks
This operator is for internal use only; do NOT use it in your ODA-based applications.

OdDAIObjectId.op_Implicit~OdDbStub*
\details
The operator for conversion to a raw pointer to the OdDbStub object.
\remarks
This method is for internal use.

OdDAIObjectId.op_LogicalNot
\details
The negation operator for the object identifier.
\returns Returns true if the object identifier is NULL; otherwise, the method returns false.

OdDAIObjectId.op_Inequality(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The non-equality operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is not equal to another one; otherwise, the method returns false.

OdDAIObjectId.op_Equality(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The equality operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is equal to another one; otherwise, the method returns false.

OdDAIObjectId.op_LessThanOrEqual(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "less or equal than" operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is less or equal than another one; otherwise, the method returns false.

OdDAIObjectId.op_GreaterThanOrEqual(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "more or equal than" operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is more or equal than another one; otherwise, the method returns false.

OdDAIObjectId.op_GreaterThan(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "more than" operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is more than another one; otherwise, the method returns false.

OdDAIObjectId.op_LessThan(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "less than" operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the operation) to be compared with.
\returns Returns true if the object identifier is less than another one; otherwise, the method returns false.

OdDAIObjectId.op_Assign(OdDbStub*)
\details
The assignment operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the assignment operation) represented with a raw pointer to an OdDbStub object.
\returns Returns the reference to the object identifier after the assignment operation is finished.

OdDAIObjectId.op_Assign(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The assignment operator for the object identifier.
\param objectId [in] Another identifier (right-hand operand of the assignment operation).
\returns Returns the reference to the object identifier after the assignment operation is finished.

OdDAIObjectId.objectLeftOnDisk
\details
Checks whether the object was unloaded from memory and left on disk.
\returns true if the object was unloaded from memory and left on the disk; otherwise, the method returns false.

OdDAIObjectId.isNonPersistent
\details
Retrieves whether the identifier's instance is non-persistent.
\returns Returns true if and only if non-null identifier doesn't belong to any owning model and has a link
to owner's identifier.
\remarks
Object identifiers for non-persistent instances are created during owning instance's derived
attributes evaluation only. Such identifiers have handle which isn't equal to zero, don't have owning model
and have link to owning instance's object identifier simultaneously.

OdDAIObjectId.isValid
\details
Retrieves whether the identifier is valid.
\returns Returns true if the identifier is valid; otherwise, the method returns false.

OdDAIObjectId.setNull
\details
Sets the identifier to the NULL state.

OdDAIObjectId.isNull
\details
Returns whether the identifier is NULL.
\returns Returns true if the identifier is NULL; otherwise, the method returns false.

OdDAIObjectId.#ctor(OdDbStub*)
\details
Creates a new object identifier based on a specified value.
\param objectId [in] A pointer to an OdDbStub object that stores data for the newly created identifier.

OdDAIObjectId.#ctor
\details
Creates a new empty object identifier.

OdDAIObjectId.kNullHandle
\details
A NULL object database handle.

OdDAIObjectId.kNull
\details
A NULL object identifier.

OdDAIObjectId.handle_type
\details
A data type represents a database handle to the same object that is referred to by the identifier.

OdDAIObjectId
\details
A class that implements an identifier of the Data Access Interface (DAI) object functionality.